app/controllers/votes_controller.rb

  def create
    @topic = Topic.find(params[:topic_id])
    @vote = @topic.votes.create!
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)
INSERT INTO "votes" ("created_at", "updated_at", "topic_id") VALUES('2009-06-13 22:58:08', '2009-06-13 22:58:08', 1)